FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/АРМКлиентыИАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМКлиентыИАвтомобили</Name>
			<Comment>АРМ Клиенты и автомобили</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Заказчик заказ-наряда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Ремонтируемый автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Поле в котором хранится телефонный номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код объекта</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ШтрихКод</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/АРМКлиентыИАвтомобили/Ext/ObjectModule.bsl
// Модуль обработки АРМКлиентыИАвтомобили

Перем Права Экспорт; // права пользователя

// Поиск клиента и автомобиля в источниках, заданных параметрами поиска
// Параметры:
//  СтрокаПоиска - Строка -  содержимое поискового запроса пользователя
// 	РасширенныйПоиск - Булево - Если истина - значит поиск осуществляется в соответствии со всеми настройками
//								с учетом флагов, ложь - поиск везде, флаги ограничений игнорируются
//  СтруктураНастройкиПоиска - Структура - Структура источников поиска
//	СтруктураФлаговНаФорме - Структура флагов отборов на форме
Функция ПоискКлиентаИАвтомобиля(СтрокаПоиска,РасширенныйПоиск,СтруктураНастройкиПоиска=Неопределено,СтруктураФлаговНаФорме=Неопределено) Экспорт
	
	//источники поиска
	НаименованиеКлиента = Истина;
	КонтактнаяИнформация = Истина; 
	ГосНомер = Истина; 
	VIN = Истина; 
	НомерКарты = Истина; 
	
	Если ТипЗнч(СтруктураНастройкиПоиска) = Тип("ТаблицаЗначений") И РасширенныйПоиск Тогда
		НаименованиеКлиента = СтруктураНастройкиПоиска.Найти("НаименованиеКлиента","Параметр").Значение;
		КонтактнаяИнформация = СтруктураНастройкиПоиска.Найти("КонтактнаяИнформация","Параметр").Значение; 
		ГосНомер = СтруктураНастройкиПоиска.Найти("ГосНомер","Параметр").Значение; 
		VIN = СтруктураНастройкиПоиска.Найти("VIN","Параметр").Значение; 
		НомерКарты = СтруктураНастройкиПоиска.Найти("НомерКарты","Параметр").Значение; 
	КонецЕсли;
	
	//флаги отборов
	ФлажокТолькоМои = Ложь;
	ФлажокЗаписанныеНаСегодня = Ложь;
	ФлажокОжидающиеВыдачи = Ложь;
	
	Если ТипЗнч(СтруктураФлаговНаФорме) = Тип("Структура") И РасширенныйПоиск  Тогда
		ФлажокТолькоМои = СтруктураФлаговНаФорме.ФлажокТолькоМои;
		ФлажокЗаписанныеНаСегодня = СтруктураФлаговНаФорме.ФлажокЗаписанныеНаСегодня;
		ФлажокОжидающиеВыдачи = СтруктураФлаговНаФорме.ФлажокОжидающиеВыдачи;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ЗапросНаименованиеКлиента =	"ВЫБРАТЬ
	                           	|	Контрагенты.Ссылка КАК Клиент
	                           	|ИЗ
	                           	|	Справочник.Контрагенты КАК Контрагенты
	                           	|ГДЕ
	                           	|	Контрагенты.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""";
				   
	ЗапросКонтактнаяИнформация = "
	               |ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект КАК Клиент
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
				   |	КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты И
	               |	КонтактнаяИнформация.Представление ПОДОБНО ""%"" + &СтрокаПоиска + ""%""";
				   
	ЗапросГосНомер = "
	               |ВЫБРАТЬ
	               |	Автомобили.Значение КАК Клиент
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних(
	               |			,
	               |			ВидЗначения = &Хозяин
	               |				И Автомобиль В
	               |					(ВЫБРАТЬ
	               |						АвтомобилиСрезПоследних.Автомобиль
	               |					ИЗ
	               |						РегистрСведений.Автомобили.СрезПоследних(, Значение ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
	               |							И ВидЗначения = &ГосНомер) КАК АвтомобилиСрезПоследних)) КАК Автомобили";
				   
	ЗапросНомерКарты = "
		           |ВЫБРАТЬ
	               |	ШтрихКоды.Объект.Объект КАК Клиент
	               |ИЗ
	               |	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	               |ГДЕ
				   |	ШтрихКоды.Объект ССЫЛКА Справочник.Карточки И
				   |	ШтрихКоды.Объект.Объект ССЫЛКА Справочник.Контрагенты И
	               |	ШтрихКоды.ШтрихКод ПОДОБНО ""%"" + &СтрокаПоиска + ""%""";
				   
				   
	ЗапросVIN = "
		           |ВЫБРАТЬ
	               |	Автомобили.Значение КАК Клиент
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних(
	               |			,
	               |			ВидЗначения = &Хозяин
	               |				И Автомобиль В
	               |					(ВЫБРАТЬ
	               |						Автомобили.Ссылка
	               |					ИЗ
	               |						Справочник.Автомобили КАК Автомобили
	               |					ГДЕ
	               |						Автомобили.VIN ПОДОБНО ""%"" + &СтрокаПоиска + ""%"")) КАК Автомобили";

	ЗапросОбъединить = "
	               |
				   |ОБЪЕДИНИТЬ
				   |";  				   
				   
	ТекстЗапроса = "
					|ВЫБРАТЬ
					|   НайденныеКлиенты.Клиент
					|ПОМЕСТИТЬ ВременнаяТаблицаКлиентов
					|ИЗ
					|	(	";
	
	ЭтоПервыйФрагмент = Истина;
	ЗапросПустой = Истина;
	
	Если НаименованиеКлиента Тогда
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросНаименованиеКлиента;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросНаименованиеКлиента;
		КонецЕсли;
	КонецЕсли;
	
	Если КонтактнаяИнформация Тогда 
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросКонтактнаяИнформация;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросКонтактнаяИнформация;
		КонецЕсли;
	КонецЕсли;
		
	Если ГосНомер Тогда 			  
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросГосНомер;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросГосНомер;
		КонецЕсли;
	КонецЕсли;
		
	Если VIN Тогда 			  
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросVIN;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросVIN;
		КонецЕсли;
	КонецЕсли;
		
	Если НомерКарты Тогда 			  
		ЗапросПустой = Ложь;
		Если ЭтоПервыйФрагмент Тогда
			ТекстЗапроса = ТекстЗапроса + ЗапросНомерКарты;
			ЭтоПервыйФрагмент = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + ЗапросОбъединить; 
			ТекстЗапроса = ТекстЗапроса + ЗапросНомерКарты;
		КонецЕсли;
	КонецЕсли;
	
	// пустой текст запроса означает, что сняты все флажки в параметрах поиска
	Если ЗапросПустой Тогда
		Сообщить("Не заданы параметры поиска. Проверьте настройки поиска!");
		Возврат Неопределено;		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса + ") КАК НайденныеКлиенты";
	Запрос.УстановитьПараметр("СтрокаПоиска",СтрокаПоиска);
	Запрос.УстановитьПараметр("ВидКарточки", Перечисления.ВидыКарточек.ДисконтнаяКарта);
	Запрос.УстановитьПараметр("ГосНомер", Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	Запрос.УстановитьПараметр("Хозяин", Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	
	КлиентыТЗ = Новый ТаблицаЗначений;
	КлиентыТЗ = Запрос.Выполнить().Выгрузить();
	
	// установка отборов на сформированную временную таблицу клиентов
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапросаИтоговый = "
					|ВЫБРАТЬ
					|	СписокКлиентов.Клиент КАК Клиент
					|ИЗ
					|	(ВЫБРАТЬ Клиент ИЗ ВременнаяТаблицаКлиентов) КАК СписокКлиентов";
	
	ЗапросФлажокТолькоМои = "
		           |(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкаНаРемонт.Заказчик КАК Клиент
	               |ИЗ
	               |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	               |ГДЕ
	               |	ЗаявкаНаРемонт.Автор = &Автор
	               |	И ЗаявкаНаРемонт.Заказчик В(ВЫБРАТЬ Клиент ИЗ ВременнаяТаблицаКлиентов)) КАК ЗапросФлажокТолькоМои
				   |ПО СписокКлиентов.Клиент = ЗапросФлажокТолькоМои.Клиент";
				   
	ЗапросЗаписанныеНаСегодня = "
		           |(ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ЗаявкаНаРемонт.Заказчик КАК Клиент 
				   |ИЗ
				   |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
				   |ГДЕ
				   |	(ЗаявкаНаРемонт.ДатаНачала < &НачалоДня
				   |				И ЗаявкаНаРемонт.ДатаОкончания > &НачалоДня
				   |			ИЛИ ЗаявкаНаРемонт.ДатаНачала < &КонецДня
				   |				И ЗаявкаНаРемонт.ДатаОкончания > &КонецДня
				   |			ИЛИ ЗаявкаНаРемонт.ДатаНачала >= &НачалоДня
				   |				И ЗаявкаНаРемонт.ДатаОкончания <= &КонецДня)
				   |	И ЗаявкаНаРемонт.Заказчик В(ВЫБРАТЬ Клиент ИЗ ВременнаяТаблицаКлиентов)) КАК ЗапросЗаписанныеНаСегодня
				   |ПО СписокКлиентов.Клиент = ЗапросЗаписанныеНаСегодня.Клиент";
				   
	ЗапросОжидающиеВыдачи = "	
		           	   |(ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	ЗаказНаряд.Заказчик КАК Клиент
					   |ИЗ
					   |	Документ.ЗаказНаряд КАК ЗаказНаряд
					   |ГДЕ
					   |	ЗаказНаряд.Заказчик В(ВЫБРАТЬ Клиент ИЗ ВременнаяТаблицаКлиентов)
					   |	И ЗаказНаряд.Состояние = &Состояние) КАК ЗапросОжидающиеВыдачи
					   |ПО СписокКлиентов.Клиент = ЗапросОжидающиеВыдачи.Клиент";
					   
   	ЗапросСоединение = "
	               |
				   |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				   |";  				   

	// Только мои
	Если ФлажокТолькоМои Тогда
		ТекстЗапросаИтоговый = ТекстЗапросаИтоговый + ЗапросСоединение + ЗапросФлажокТолькоМои;
		Запрос.УстановитьПараметр("Автор", ПараметрыСеанса.Пользователь);
	КонецЕсли;

	// Записанные на сегодня
	Если ФлажокЗаписанныеНаСегодня Тогда
		ТекстЗапросаИтоговый = ТекстЗапросаИтоговый + ЗапросСоединение + ЗапросЗаписанныеНаСегодня;
		Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("КонецДня", Конецдня(ТекущаяДата()));
	КонецЕсли;

	// Клиенты на сервисе
	
	// Ожидающие выдачи
	Если ФлажокОжидающиеВыдачи Тогда
		ТекстЗапросаИтоговый = ТекстЗапросаИтоговый + ЗапросСоединение + ЗапросОжидающиеВыдачи;
		Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Выполнен);
	КонецЕсли;

	ТекстЗапросаИтоговый = ТекстЗапросаИтоговый + " УПОРЯДОЧИТЬ ПО Клиент";
	
	Запрос.Текст = ТекстЗапросаИтоговый;
    ВыборкаТЗ = Запрос.Выполнить().Выгрузить();
	СписокКлиентов = Новый СписокЗначений;
	СписокКлиентов.ЗагрузитьЗначения(ВыборкаТЗ.ВыгрузитьКолонку("Клиент"));
	Возврат СписокКлиентов;
КонецФункции

Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
